Tekla Open API Reference for Tekla Structures 2025
IAssemblable Methods
The IAssemblable type exposes the following members.
Methods
Name | Description
GetAssembly
 Returns the assembly that the assemblable belongs to.
Top
See Also
Reference
IAssemblable Interface
Tekla.Structures.Model Namespace